Workspace/test_cases/Acoustic-test/NonLinearAcoustic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
vertices (
 (0 0 0)    //0
 (100 0 0)  //1
 (100 5 0)  //2
 (0 5 0)    //3
 (0 0 .1)   //4
 (100 0 .1) //5
 (100 5 .1) //6
 (0 5 .1)   //7
);
blocks (
 hex (0 1 2 3 4 5 6 7) (300 20 1) simpleGrading (1 1 1)
 );

edges (
);
boundary (
fixedWalls {
        type wall;
        faces
        (
 (1 2 6 5) //right face
        );
}
inlet {
        type patch;
        faces
        (
 (4 7 3 0) //left face
        );
}
outlet {
        type patch;
        faces
        (
 (2 3 7 6) //Top face
 (0 1 5 4) //Bottom face
        ); 
    }
     frontAndBack
    {
        type empty;
        faces
        (
 (0 3 2 1) //back
 (4 5 6 7) //front
       ); 
   }
);
mergePatchPairs
(
);

// ************************************************************************* //

